# 3. Реализовать функцию my_func(),
# которая принимает три позиционных аргумента,
# и возвращает сумму наибольших двух аргументов.


def my_func(x,y,z):
   a = x + y
   b = x + z
   c = y + z
   print(max(a,b,c))

my_func(4,2,3)




